{
    "Aries+Libra": "Aries and Libra, as opposite signs, have a magnetic attraction. Aries' boldness complements Libra's charm and diplomacy, creating a balanced dynamic. While Aries loves to take charge, Libra's cooperative nature helps smooth over conflicts. This pairing thrives on mutual respect and admiration, blending Aries' fiery passion with Libra's harmonious approach.",
    "Taurus+Scorpio": "Taurus and Scorpio are both fixed signs, leading to a deeply intense and committed relationship. Taurus values stability and loyalty, which aligns well with Scorpio's desire for depth and emotional connection. Their shared determination can either strengthen their bond or lead to power struggles, but their mutual devotion often helps them overcome challenges.",
    "Gemini+Sagittarius": "Gemini and Sagittarius share a love for adventure and intellectual pursuits. Both signs are curious and value freedom, making their relationship dynamic and exciting. Gemini's adaptability pairs well with Sagittarius' optimism and sense of adventure. Their mutual desire for exploration and growth can create a stimulating and fulfilling partnership.",
    "Cancer+Capricorn": "Cancer and Capricorn, despite their differences, can form a strong and enduring relationship. Cancer's nurturing nature complements Capricorn's ambition and practicality. While Cancer provides emotional support and warmth, Capricorn offers stability and structure. Together, they can build a secure and loving home, balancing each other's strengths and weaknesses.",
    "Leo+Aquarius": "Leo and Aquarius are both strong-willed and independent, leading to a relationship full of excitement and innovation. Leo's charisma and need for admiration pair well with Aquarius' uniqueness and visionary outlook. They both enjoy socializing and can inspire each other, but they need to respect each other's need for individuality to maintain harmony.",
    "Virgo+Pisces": "Virgo and Pisces, as opposite signs, have a natural attraction that can lead to a harmonious relationship. Virgo's practicality and attention to detail complement Pisces' creativity and emotional depth. While Virgo helps ground Pisces' dreams, Pisces can teach Virgo to be more compassionate and open-hearted. Together, they can create a balanced and supportive partnership.",
    "Default": "Sadly, these two signs are not fated to be together romantically"
}
