{
    "Aries + Libra": "High Compatibility: Aries and Libra, as opposite signs, have a magnetic attraction. Aries' boldness complements Libra's charm and diplomacy, creating a balanced dynamic. While Aries loves to take charge, Libra's cooperative nature helps smooth over conflicts. This pairing thrives on mutual respect and admiration, blending Aries' fiery passion with Libra's harmonious approach. They both value social connections, making them a popular and dynamic duo in any social setting.",
    "Taurus + Scorpio": "High Compatibility: Taurus and Scorpio are both fixed signs, leading to a deeply intense and committed relationship. Taurus values stability and loyalty, which aligns well with Scorpio's desire for depth and emotional connection. Their shared determination can either strengthen their bond or lead to power struggles, but their mutual devotion often helps them overcome challenges. Together, they can build a foundation of trust and intimacy, finding strength in their shared sensuality and persistence.",
    "Gemini + Sagittarius": "High Compatibility: Gemini and Sagittarius share a love for adventure and intellectual pursuits. Both signs are curious and value freedom, making their relationship dynamic and exciting. Gemini's adaptability pairs well with Sagittarius' optimism and sense of adventure. Their mutual desire for exploration and growth can create a stimulating and fulfilling partnership. They thrive on communication and spontaneity, always finding new ways to keep their bond fresh and inspiring.",
    "Cancer + Capricorn": "High Compatibility: Cancer and Capricorn, despite their differences, can form a strong and enduring relationship. Cancer's nurturing nature complements Capricorn's ambition and practicality. While Cancer provides emotional support and warmth, Capricorn offers stability and structure. Together, they can build a secure and loving home, balancing each other's strengths and weaknesses. Their shared values of family and loyalty make them a steadfast and resilient couple, capable of weathering any storm.",
    "Leo + Aquarius": "Medium Compatibility: Leo and Aquarius are both strong-willed and independent, leading to a relationship full of excitement and innovation. Leo's charisma and need for admiration pair well with Aquarius' uniqueness and visionary outlook. They both enjoy socializing and can inspire each other, but they need to respect each other's need for individuality to maintain harmony. Their relationship is marked by mutual admiration and a shared passion for making a difference in the world.",
    "Virgo + Pisces": "High Compatibility: Virgo and Pisces, as opposite signs, have a natural attraction that can lead to a harmonious relationship. Virgo's practicality and attention to detail complement Pisces' creativity and emotional depth. While Virgo helps ground Pisces' dreams, Pisces can teach Virgo to be more compassionate and open-hearted. Together, they can create a balanced and supportive partnership. Their blend of realism and idealism allows them to build a life filled with mutual respect and understanding.",
    "Aries + Gemini": "High Compatibility: Aries and Gemini form a lively and energetic partnership. Aries' enthusiasm and drive match well with Gemini's curiosity and adaptability. Both enjoy new experiences and adventure, keeping their relationship dynamic and exciting. Communication flows easily between them, fostering a bond of mutual understanding and intellectual stimulation.",
    "Taurus + Cancer": "High Compatibility: Taurus and Cancer share a love for home and family, creating a nurturing and stable relationship. Taurus' practicality and loyalty complement Cancer's emotional depth and care. Together, they build a secure and loving environment, where both partners feel valued and understood. Their mutual dedication to each other ensures a lasting and fulfilling bond.",
    "Gemini + Aquarius": "High Compatibility: Gemini and Aquarius thrive on intellectual connection and shared interests. Both signs value independence and have a strong desire for knowledge and innovation. Their relationship is marked by lively conversations and a mutual appreciation for each other's unique perspectives. Together, they can explore new ideas and experiences, keeping their bond fresh and stimulating.",
    "Cancer + Pisces": "High Compatibility: Cancer and Pisces share a deep emotional connection, creating a compassionate and understanding partnership. Both signs are intuitive and sensitive, valuing emotional security and empathy. Their relationship is built on mutual support and care, with each partner providing the other with a sense of comfort and belonging. Together, they create a loving and harmonious home.",
    "Leo + Sagittarius": "High Compatibility: Leo and Sagittarius are both passionate and adventurous, forming a vibrant and enthusiastic relationship. Leo's charisma and warmth complement Sagittarius' optimism and love for exploration. They inspire each other to pursue their dreams and enjoy life to the fullest. Their shared enthusiasm and zest for life create a dynamic and exciting partnership.",
    "Virgo + Capricorn": "High Compatibility: Virgo and Capricorn share a practical and goal-oriented approach to life, forming a strong and reliable partnership. Both signs value hard work and dedication, supporting each other in their ambitions. Virgo's attention to detail complements Capricorn's strategic planning, allowing them to achieve their shared goals. Together, they build a stable and prosperous future.",
    "Libra + Aquarius": "High Compatibility: Libra and Aquarius both value intellectual stimulation and social connections, creating a harmonious and balanced relationship. Libra's charm and diplomacy complement Aquarius' innovative and forward-thinking nature. They enjoy engaging in deep conversations and exploring new ideas together. Their mutual respect and understanding foster a strong and enduring bond.",
    "Scorpio + Pisces": "High Compatibility: Scorpio and Pisces share a profound emotional connection, creating a deeply intimate and transformative relationship. Both signs are intuitive and seek a meaningful bond, valuing trust and emotional depth. Scorpio's intensity and passion are balanced by Pisces' compassion and empathy. Together, they create a powerful and healing partnership, where both feel understood and cherished.",
    "Aries + Sagittarius": "High Compatibility: Aries and Sagittarius both have a zest for life and adventure, forming an exciting and dynamic partnership. Aries' boldness and drive complement Sagittarius' optimism and love for exploration. They inspire each other to pursue their passions and enjoy new experiences. Their shared enthusiasm and energetic approach to life create a stimulating and fulfilling relationship.",
    "Taurus + Virgo": "High Compatibility: Taurus and Virgo share a practical and grounded approach to life, creating a stable and harmonious relationship. Both signs value loyalty and hard work, supporting each other in their endeavors. Taurus' patience and reliability complement Virgo's attention to detail and dedication. Together, they build a secure and prosperous future, enjoying a deep sense of mutual respect and understanding.",
    "Gemini + Libra": "High Compatibility: Gemini and Libra both value communication and intellectual connection, forming a balanced and stimulating partnership. Gemini's curiosity and adaptability complement Libra's charm and diplomacy. They enjoy engaging in lively conversations and exploring new ideas together. Their mutual appreciation for social interactions and harmony creates a dynamic and harmonious relationship.",
    "Cancer + Scorpio": "High Compatibility: Cancer and Scorpio share a deep emotional bond, creating an intense and committed relationship. Both signs value trust and loyalty, supporting each other through thick and thin. Cancer's nurturing nature complements Scorpio's passion and determination. Together, they create a powerful and loving partnership, built on mutual respect and emotional depth.",
    "Leo + Pisces": "Medium Compatibility: Leo and Pisces have different approaches to life, but their differences can create a complementary and supportive relationship. Leo's charisma and confidence can help bring Pisces' dreams to life, while Pisces' sensitivity and creativity can soften Leo's boldness. Their relationship requires understanding and compromise, but their shared desire for love and connection can help them build a harmonious and fulfilling partnership.",
    "Virgo + Scorpio": "High Compatibility: Virgo and Scorpio both value depth and dedication, forming a strong and committed partnership. Virgo's practicality and attention to detail complement Scorpio's intensity and passion. They support each other's goals and work together to overcome challenges. Their mutual respect and shared values create a powerful and enduring bond.",
    "Aries + Capricorn": "Medium Compatibility: Aries and Capricorn have very different approaches to life, which can lead to both challenges and growth opportunities. Aries' boldness and impulsivity contrast with Capricorn's caution and discipline. However, if they can appreciate and learn from each other's strengths, they can create a balanced and dynamic partnership. Aries can help Capricorn take more risks and embrace spontaneity, while Capricorn can provide structure and support for Aries' ambitions.",
    "Taurus + Leo": "Medium Compatibility: Taurus and Leo both value loyalty and stability, but they express their love in very different ways. Taurus is practical and prefers a calm, steady life, while Leo seeks excitement and admiration. If they can respect each other's differences and find common ground, they can form a strong and supportive partnership. Taurus can provide grounding for Leo's exuberance, and Leo can add a spark of excitement to Taurus' routine.",
    "Gemini + Virgo": "Medium Compatibility: Gemini and Virgo have different approaches to life, but their differences can create a complementary relationship. Gemini's adaptability and curiosity can help Virgo become more open-minded and spontaneous, while Virgo's practicality and attention to detail can provide structure and stability for Gemini. Their relationship requires patience and understanding, but their shared love of learning and communication can help them build a strong bond.",
    "Cancer + Leo": "Medium Compatibility: Cancer and Leo have different needs and approaches to relationships, which can create both challenges and opportunities for growth. Cancer seeks emotional security and nurturing, while Leo desires admiration and excitement. If they can appreciate and support each other's needs, they can create a balanced and fulfilling partnership. Cancer can provide emotional depth and care, while Leo can bring warmth and enthusiasm to the relationship.",
    "Libra + Scorpio": "Medium Compatibility: Libra and Scorpio have very different approaches to relationships, but their differences can create a dynamic and transformative partnership. Libra seeks harmony and balance, while Scorpio desires intensity and emotional depth. If they can respect and learn from each other's perspectives, they can build a powerful and passionate relationship. Libra can help Scorpio find peace and balance, while Scorpio can bring depth and intensity to Libra's life.",
    "Sagittarius + Capricorn": "Medium Compatibility: Sagittarius and Capricorn have contrasting approaches to life, which can create both challenges and growth opportunities. Sagittarius is adventurous and optimistic, valuing freedom and spontaneity, while Capricorn is practical and disciplined, prioritizing stability and long-term goals. If they can find a balance between Sagittarius' need for exploration and Capricorn's desire for security, they can create a strong and harmonious partnership. Sagittarius can inspire Capricorn to embrace new experiences, while Capricorn can provide grounding and support for Sagittarius' aspirations.",
    "Aquarius + Pisces": "Medium Compatibility: Aquarius and Pisces have different approaches to life, but their differences can complement each other well. Aquarius is innovative and idealistic, valuing independence and intellectual pursuits, while Pisces is sensitive and intuitive, seeking emotional connection and spiritual growth. If they can appreciate and learn from each other's perspectives, they can create a compassionate and inspiring partnership. Aquarius can help Pisces stay grounded and focused on their goals, while Pisces can teach Aquarius to embrace their emotions and intuition.",
    "Default": "Low Compatibility: Sadly, these two signs are not fated to be together romantically. But don't worry, there are plenty of other compatible matches out there! Every sign has unique qualities that can create a beautiful relationship with the right partner. Keep exploring, and you'll find the connection that's perfect for you."
}